NextFOAM-2602/tutorials/combustion/coldEngineFoam/freePiston/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM:.Uhe Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/caseSettings"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $/internalField/U;

boundaryField
{
    back
    {
        type            wedge;
    }

    front
    {
        $back;
    }

    liner
    {
        $/wall/U;
    }

    cylinderHead
    {
        $liner;
    }

    piston
    {
        $/piston/U;
    }
}

#remove (wall piston)

// ************************************************************************* //
